Практос_2/src/Documents/НазначениеИнтервью/НазначениеИнтервью.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеИнтервью</name>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекрутер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобеседованияИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликацияВакансии</name>
    <type>
      <types>DocumentRef.ПубликацияВакансии</types>
    </type>
  </attributes>
</mdclass:Document>

Практос_2/src/InformationRegisters/ИсторияКандидатов/ИсторияКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Практос_2/src/InformationRegisters/ОткликиКандидатов/ОткликиКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОткликиКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </resources>
  <attributes>
    <name>СопроводительноеПисьмо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Публикация</name>
    <type>
      <types>DocumentRef.ПубликацияВакансии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Практос_2/src/Documents/НазначениеИнтервью/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияКандидатов
	Движения.ИсторияКандидатов.Записывать = Истина;
	Движение = Движения.ИсторияКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Кандидат = Кандидат;
	Движение.Вакансия = Вакансия;
	Движение.ЭтапПодбора = ЭтапПодбора;
	Движение.Ответственный = Рекрутер;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ   
	
Запрос = Новый Запрос;
	// Ищем отклик в регистре, сравнивая Кандидата напрямую, 
	// а Вакансию — через её наличие внутри документа Публикации
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОткликиКандидатов.Кандидат КАК Кандидат,
		|	ОткликиКандидатов.Публикация КАК Публикация
		|ИЗ
		|	РегистрСведений.ОткликиКандидатов КАК ОткликиКандидатов
		|ГДЕ
		|	ОткликиКандидатов.Кандидат = &ПараметрКандидат
		|	И ОткликиКандидатов.Публикация.Вакансия = &ПараметрВакансия"; 
	
	Запрос.УстановитьПараметр("ПараметрКандидат", ЭтотОбъект.Кандидат);
	Запрос.УстановитьПараметр("ПараметрВакансия", ЭтотОбъект.Вакансия); // Реквизит Вакансия из Собеседования
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		// Скобка убрана, теперь синтаксис идеален:
		МенеджерЗаписи = РегистрыСведений.ОткликиКандидатов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Кандидат   = ЭтотОбъект.Кандидат;
		МенеджерЗаписи.Публикация  = Выборка.Публикация; // Берем точную публикацию, которую нашел запрос
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.СтатусОтклика = ЭтотОбъект.ЭтапПодбора; 
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				Отказ = Истина;
				ВызватьИсключение ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
	Иначе
		// Если даже по Вакансии не нашлось, выводим подсказку
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Text = "В регистре не найден отклик для кандидата " + ЭтотОбъект.Кандидат + " по вакансии " + ЭтотОбъект.Вакансия;
		Сообщение.Сообщить();
	КонецЕсли;КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Блок А: Ввод на основании документа НазначениеИнтервью
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеИнтервью") Тогда
		
		ЭтотОбъект.Кандидат      = ДанныеЗаполнения.Кандидат;
		ЭтотОбъект.Вакансия       = ДанныеЗаполнения.Вакансия;
		ЭтотОбъект.Ответственный  = ДанныеЗаполнения.Ответственный;
		ЭтотОбъект.ПубликацияВакансии = ДанныеЗаполнения.Ссылка;
		
	// Блок Б: Нажатие вашей кнопки в динамическом списке
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Кандидат") Тогда
			ЭтотОбъект.Кандидат = ДанныеЗаполнения.Кандидат;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
